EEESlab/mobilenet_v1_stm32_cmsis_nn/Src/main.c
#define USR_GET_CC_TIMESTAMP(x) \
  do { \
	asm volatile("" ::: "memory"); \
	x = (*(volatile unsigned int *) DWT_CYCCNT); \
	asm volatile("" ::: "memory"); \
  } while (0)
#else
#define USR_MEM_BARRIER()
#define USR_CC_ENABLE()
#define USR_CC_RESET()
#define USR_GET_CC_TIMESTAMP(x)
#endif

#define MOBILENET_CHECKSUM 0
#if MOBILENET_CHECKSUM
volatile unsigned int checksums[30];
#define USR_CHECKSUM(x,nb_elements,id) \
  do { \
	asm volatile("" ::: "memory"); \
	checksums[id] = 0; \
	for(int i=0; i< nb_elements;i++) \
		checksums[id]+=x[i]; \
	asm volatile("" ::: "memory"); \
  } while (0)
#else
#define USR_CHECKSUM(x,nb_elements,id)
#endif

int main(void)
{
	SCB_EnableICache(); //Enable I-Cache
	SCB_EnableDCache(); //Enable D-Cache
	HAL_Init();
	SystemClock_Config();
	MX_GPIO_Init();

	while(1) {
		int 	layerId = 0;
		int 	tensorId = 0;
		uint8_t *tensorIn  = l2_tensor_scratch;
		uint8_t *tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV1_OUT_DIM*CONV1_OUT_DIM*CONV1_OUT_CH);

		/*Layer 1	Conv / s2
		*Convolutional
		*Cycle =c
		*/
		USR_CC_ENABLE();
		USR_CC_RESET();
		arm_convolve_HWC_asym_uint8(image_data, CONV1_IM_DIM, CONV1_IM_CH,
								  conv1_wt, CONV1_W_Z, CONV1_IN_Z, CONV1_OUT_Z, CONV1_M_ZERO, CONV1_N_ZERO,
								  CONV1_OUT_CH, CONV1_KER_DIM,
								  CONV1_L_PADDING, CONV1_R_PADDING, CONV1_T_PADDING, CONV1_B_PADDING, CONV1_STRIDE, conv1_bias,
								  tensorOut, CONV1_OUT_DIM, l1_tensor_scratch, NULL);
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV1_IM_CH * CONV1_IM_DIM * CONV1_IM_DIM,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV2_OUT_DIM*CONV2_OUT_DIM*CONV2_OUT_CH);
		tensorId = !tensorId;

		/*Layer 2	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV2_IM_DIM, CONV2_IM_CH,
								  conv2_wt, CONV2_W_Z, CONV2_IN_Z, CONV2_OUT_Z, CONV2_M_ZERO, CONV2_N_ZERO,
								  CONV2_OUT_CH, CONV2_KER_DIM,
								  CONV2_L_PADDING, CONV2_R_PADDING, CONV2_T_PADDING, CONV2_B_PADDING, CONV2_STRIDE, conv2_bias,
								  tensorOut, CONV2_OUT_DIM, l1_tensor_scratch, NULL);
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV2_OUT_DIM*CONV2_OUT_DIM*CONV2_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV3_OUT_DIM*CONV3_OUT_DIM*CONV3_OUT_CH);
		tensorId = !tensorId;

		/*Layer 3	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV3_IM_DIM, CONV3_IM_CH,
								  conv3_wt, CONV3_W_Z, CONV3_IN_Z, CONV3_OUT_Z, CONV3_M_ZERO, CONV3_N_ZERO,
								  CONV3_OUT_CH, CONV3_KER_DIM,
								  CONV3_L_PADDING, CONV3_R_PADDING, CONV3_T_PADDING, CONV3_B_PADDING, CONV3_STRIDE, conv3_bias,
								  tensorOut, CONV3_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV3_OUT_DIM*CONV3_OUT_DIM*CONV3_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV4_OUT_DIM*CONV4_OUT_DIM*CONV4_OUT_CH);
		tensorId = !tensorId;

		/*Layer 4	Conv dw/ s2
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV4_IM_DIM, CONV4_IM_CH,
								  conv4_wt, CONV4_W_Z, CONV4_IN_Z, CONV4_OUT_Z, CONV4_M_ZERO, CONV4_N_ZERO,
								  CONV4_OUT_CH, CONV4_KER_DIM,
								  CONV4_L_PADDING, CONV4_R_PADDING, CONV4_T_PADDING, CONV4_B_PADDING, CONV4_STRIDE, conv4_bias,
								  tensorOut, CONV4_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV4_OUT_DIM*CONV4_OUT_DIM*CONV4_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV5_OUT_DIM*CONV5_OUT_DIM*CONV5_OUT_CH);
		tensorId = !tensorId;

		/*Layer 5	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV5_IM_DIM, CONV5_IM_CH,
								  conv5_wt, CONV5_W_Z, CONV5_IN_Z, CONV5_OUT_Z, CONV5_M_ZERO, CONV5_N_ZERO,
								  CONV5_OUT_CH, CONV5_KER_DIM,
								  CONV5_L_PADDING, CONV5_R_PADDING, CONV5_T_PADDING, CONV5_B_PADDING, CONV5_STRIDE, conv5_bias,
								  tensorOut, CONV5_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV5_OUT_DIM*CONV5_OUT_DIM*CONV5_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV6_OUT_DIM*CONV6_OUT_DIM*CONV6_OUT_CH);
		tensorId = !tensorId;

		/*Layer 6	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV6_IM_DIM, CONV6_IM_CH,
								  conv6_wt, CONV6_W_Z, CONV6_IN_Z, CONV6_OUT_Z, CONV6_M_ZERO, CONV6_N_ZERO,
								  CONV6_OUT_CH, CONV6_KER_DIM,
								  CONV6_L_PADDING, CONV6_R_PADDING, CONV6_T_PADDING, CONV6_B_PADDING, CONV6_STRIDE, conv6_bias,
								  tensorOut, CONV6_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV6_OUT_DIM*CONV6_OUT_DIM*CONV6_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV7_OUT_DIM*CONV7_OUT_DIM*CONV7_OUT_CH);
		tensorId = !tensorId;

		/*Layer 7	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV7_IM_DIM, CONV7_IM_CH,
								  conv7_wt, CONV7_W_Z, CONV7_IN_Z, CONV7_OUT_Z, CONV7_M_ZERO, CONV7_N_ZERO,
								  CONV7_OUT_CH, CONV7_KER_DIM,
								  CONV7_L_PADDING, CONV7_R_PADDING, CONV7_T_PADDING, CONV7_B_PADDING, CONV7_STRIDE, conv7_bias,
								  tensorOut, CONV7_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV7_OUT_DIM*CONV7_OUT_DIM*CONV7_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV8_OUT_DIM*CONV8_OUT_DIM*CONV8_OUT_CH);
		tensorId = !tensorId;

		/*Layer 8	Conv dw/ s2
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV8_IM_DIM, CONV8_IM_CH,
								  conv8_wt, CONV8_W_Z, CONV8_IN_Z, CONV8_OUT_Z, CONV8_M_ZERO, CONV8_N_ZERO,
								  CONV8_OUT_CH, CONV8_KER_DIM,
								  CONV8_L_PADDING, CONV8_R_PADDING, CONV8_T_PADDING, CONV8_B_PADDING, CONV8_STRIDE, conv8_bias,
								  tensorOut, CONV8_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV8_OUT_DIM*CONV8_OUT_DIM*CONV8_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV9_OUT_DIM*CONV9_OUT_DIM*CONV9_OUT_CH);
		tensorId = !tensorId;

		/*Layer 9	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV9_IM_DIM, CONV9_IM_CH,
								  conv9_wt, CONV9_W_Z, CONV9_IN_Z, CONV9_OUT_Z, CONV9_M_ZERO, CONV9_N_ZERO,
								  CONV9_OUT_CH, CONV9_KER_DIM,
								  CONV9_L_PADDING, CONV9_R_PADDING, CONV9_T_PADDING, CONV9_B_PADDING, CONV9_STRIDE, conv9_bias,
								  tensorOut, CONV9_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV9_OUT_DIM*CONV9_OUT_DIM*CONV9_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV10_OUT_DIM*CONV10_OUT_DIM*CONV10_OUT_CH);
		tensorId = !tensorId;

