EEESlab/mobilenet_v1_stm32_cmsis_nn/Src/main.c
		/*Layer 22	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV22_IM_DIM, CONV22_IM_CH,
									  conv22_wt, CONV22_W_Z, CONV22_IN_Z, CONV22_OUT_Z, CONV22_M_ZERO, CONV22_N_ZERO,
									  CONV22_OUT_CH, CONV22_KER_DIM,
									  CONV22_L_PADDING, CONV22_R_PADDING, CONV22_T_PADDING, CONV22_B_PADDING, CONV22_STRIDE, conv22_bias,
									  tensorOut, CONV22_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV22_OUT_DIM*CONV22_OUT_DIM*CONV22_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV23_OUT_DIM*CONV23_OUT_DIM*CONV23_OUT_CH);
		tensorId = !tensorId;

		/*Layer 23	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV23_IM_DIM, CONV23_IM_CH,
									  conv23_wt, CONV23_W_Z, CONV23_IN_Z, CONV23_OUT_Z, CONV23_M_ZERO, CONV23_N_ZERO,
									  CONV23_OUT_CH, CONV23_KER_DIM,
									  CONV23_L_PADDING, CONV23_R_PADDING, CONV23_T_PADDING, CONV23_B_PADDING, CONV23_STRIDE, conv23_bias,
									  tensorOut, CONV23_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV23_OUT_DIM*CONV23_OUT_DIM*CONV23_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV24_OUT_DIM*CONV24_OUT_DIM*CONV24_OUT_CH);
		tensorId = !tensorId;

		/*Layer 24	Conv dw/ s2
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV24_IM_DIM, CONV24_IM_CH,
									  conv24_wt, CONV24_W_Z, CONV24_IN_Z, CONV24_OUT_Z, CONV24_M_ZERO, CONV24_N_ZERO,
									  CONV24_OUT_CH, CONV24_KER_DIM,
									  CONV24_L_PADDING, CONV24_R_PADDING, CONV24_T_PADDING, CONV24_B_PADDING, CONV24_STRIDE, conv24_bias,
									  tensorOut, CONV24_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV24_OUT_DIM*CONV24_OUT_DIM*CONV24_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV25_OUT_DIM*CONV25_OUT_DIM*CONV25_OUT_CH);
		tensorId = !tensorId;

		/*Layer 25	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV25_IM_DIM, CONV25_IM_CH,
									  conv25_wt, CONV25_W_Z, CONV25_IN_Z, CONV25_OUT_Z, CONV25_M_ZERO, CONV25_N_ZERO,
									  CONV25_OUT_CH, CONV25_KER_DIM,
									  CONV25_L_PADDING, CONV25_R_PADDING, CONV25_T_PADDING, CONV25_B_PADDING, CONV25_STRIDE, conv25_bias,
									  tensorOut, CONV25_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV25_OUT_DIM*CONV25_OUT_DIM*CONV25_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV26_OUT_DIM*CONV26_OUT_DIM*CONV26_OUT_CH);
		tensorId = !tensorId;

		/*Layer 26	Conv dw/ s1
		*dephtwise
		*Cycle =
		*/
		arm_depthwise_separable_conv_HWC_asym_uint8(tensorIn, CONV26_IM_DIM, CONV26_IM_CH,
									  conv26_wt, CONV26_W_Z, CONV26_IN_Z, CONV26_OUT_Z, CONV26_M_ZERO, CONV26_N_ZERO,
									  CONV26_OUT_CH, CONV26_KER_DIM,
									  CONV26_L_PADDING, CONV26_R_PADDING, CONV26_T_PADDING, CONV26_B_PADDING, CONV26_STRIDE, conv26_bias,
									  tensorOut, CONV26_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV26_OUT_DIM*CONV26_OUT_DIM*CONV26_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (CONV27_OUT_DIM*CONV27_OUT_DIM*CONV27_OUT_CH);
		tensorId = !tensorId;

		/*Layer 27	Conv Point/ s1
		*pointwise
		*Cycle =
		*/
		arm_convolve_HWC_asym_uint8(tensorIn, CONV27_IM_DIM, CONV27_IM_CH,
									  conv27_wt, CONV27_W_Z, CONV27_IN_Z, CONV27_OUT_Z, CONV27_M_ZERO, CONV27_N_ZERO,
									  CONV27_OUT_CH, CONV27_KER_DIM,
									  CONV27_L_PADDING, CONV27_R_PADDING, CONV27_T_PADDING, CONV27_B_PADDING, CONV27_STRIDE, conv27_bias,
									  tensorOut, CONV27_OUT_DIM, l1_tensor_scratch, NULL);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,CONV27_OUT_DIM*CONV27_OUT_DIM*CONV27_OUT_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (FC28_IM_CH);
		tensorId = !tensorId;

		/*Layer 28	Avgpool */
		arm_avepool_asym_uint8_HWC(tensorIn, CONV27_OUT_DIM, CONV27_OUT_CH, 5, 0, 5, 1, l1_tensor_scratch, tensorOut);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,FC28_IM_CH,layerId); layerId++;

		tensorIn  = tensorOut;
		if (!tensorId)
			tensorOut = l2_tensor_scratch;
		else
			tensorOut = l2_tensor_scratch + L2_TENSOR_IO_SIZE - (FC28_OUT_CH);
		tensorId = !tensorId;

		/*Layer 29	FC
		*Cycle =
		*/
		arm_fully_connected_asym_uint8(tensorIn, fc28_wt, FC28_IM_CH, FC28_OUT_CH, FC28_W_Z, FC28_IN_Z, FC28_OUT_Z, FC28_M_ZERO, FC28_N_ZERO, fc28_bias, tensorOut, l1_tensor_scratch);

		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);
		USR_CHECKSUM(tensorOut,FC28_OUT_CH,layerId); layerId++;

		USR_MEM_BARRIER();
		int top5[5];
		int top5_score[5];
		for (int i=0; i<5; i++){
			int max=0;
			for(int ii=0; ii<FC28_OUT_CH; ii++)
				if (tensorOut[ii] > max){
					top5[i] = ii;
					top5_score[i] = tensorOut[ii];
					max= tensorOut[ii];
				}
			tensorOut[top5[i]]=0;
		}
		USR_GET_CC_TIMESTAMP(cpu_cycles[layerId]);

		for (int i = 0; i < 5; i++){
		      printf("%d: %d\n", top5[i], top5_score[i]);
		}
	}
  return 0;
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

